import React from 'react'

export default function Events() {

const imageSize = {
    maxHeight: "300px",
    objectFit: "cover",
    };

  return (
    <div className='mx-3 bg-light'>
        <div className="row">
            {/* Left side */}
            <div className="col-md-6 p-5">
                <h2>रक्तदान शिविर (80 यूनिट)</h2>
                <p>
                    इसमें समाज एवं मेहनतकश लोगों की सहमति से 2017 में इस सभा का गठन किया गया, जो समाज के विभिन्न क्षेत्रों के असीम प्रेम, सहयोग हेतु किया गया। अथक प्रयास और मेहनत का जीता जागता उदाहरण, अनेकता में एकता को दर्शाता है।

                    इस संस्था को सुचारू और सुव्यवस्थित तरीके से चलाने के लिए, निम्नलिखित निकाय सदस्यों का गठन किया गया और सोसायटी कानून के अनुसार 3 साल की अवधि के लिए चुना गया, पहले निर्वाचित निकाय सदस्यों को महामारी COVID19 के कारण 6 साल के लिए बढ़ा दिया गया था।

                    शुरुआत में निर्वाचित सदस्यों और उत्तराखंड निवासियों के साथ हर साल माता का जागरण आयोजित किया जाता था, साथ ही रक्तदान शिविर, स्वच्छता अभियान, चिकित्सा शिविर जैसी सामाजिक गतिविधियों के साथ जरूरतमंदों को आर्थिक और सामाजिक रूप से मदद की जाती थी।

                    संगठन के कार्यप्रवाह को जारी रखने के लिए फरवरी 2023 में नए निकाय सदस्यों का चुनाव किया गया, जिन्होंने 6 महीने के भीतर विभिन्न


                    <br/>
                    <br/>
                    <br/>
                    

                    इसमें समाज एवं मेहनतकश लोगों की सहमति से 2017 में इस सभा का गठन किया गया, जो समाज के विभिन्न क्षेत्रों के असीम प्रेम, सहयोग हेतु किया गया। अथक प्रयास और मेहनत का जीता जागता उदाहरण, अनेकता में एकता को दर्शाता है।

                    इस संस्था को सुचारू और सुव्यवस्थित तरीके से चलाने के लिए, निम्नलिखित निकाय सदस्यों का गठन किया गया और सोसायटी कानून के अनुसार 3 साल की अवधि के लिए चुना गया, पहले निर्वाचित निकाय सदस्यों को महामारी COVID19 के कारण 6 साल के लिए बढ़ा दिया गया था।

                    शुरुआत में निर्वाचित सदस्यों और उत्तराखंड निवासियों के साथ हर साल माता का जागरण आयोजित किया जाता था, साथ ही रक्तदान शिविर, स्वच्छता अभियान, चिकित्सा शिविर जैसी सामाजिक गतिविधियों के साथ जरूरतमंदों को आर्थिक और सामाजिक रूप से मदद की जाती थी।

                    संगठन के कार्यप्रवाह को जारी रखने के लिए फरवरी 2023 में नए निकाय सदस्यों का चुनाव किया गया, जिन्होंने 6 महीने के भीतर विभिन्न
                </p>
            </div>

            {/* Right side */}
            <div className="col-md-6 p-1">
        <div className="row py-3">
            <div className="col-md-4">
                <img src="assets/images/bd1.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
            <div className="col-md-4">
                <img src="assets/images/bd2.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
            <div className="col-md-4">
                <img src="assets/images/bd3.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
            <div className="col-md-4">
                <img src="assets/images/bd4.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
            <div className="col-md-4">
                <img src="assets/images/bd5.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
            <div className="col-md-4">
                <img src="assets/images/bd6.jpg" alt="" className="img-fluid m-1" style={imageSize}/>
            </div>
                       
      </div>
    </div>
        </div>
    </div>
  )
}
